app/Http/Controllers/CartController.php

select `user_cart`.`id` as `cart_id`, `user_cart`.`product_id`, `user_cart`.`qty` as `quantity`, `product`.`name`, `product`.`price`, `product`.`image`, `product`.`discount`, CASE WHEN product.discount > 0
THEN product.price - (product.price * product.discount / 100)
ELSE product.price END as final_price from `user_cart` inner join `product` on `user_cart`.`product_id` = `product`.`id` where `user_cart`.`user_id` = 1
---
    public function index()
    {
        try {
            // Get cart items with product details
            $cart_items = DB::table('user_cart')
                ->join('product', 'user_cart.product_id', '=', 'product.id')
                ->where('user_cart.user_id', $this->userId)
                ->select(
                    'user_cart.id as cart_id',
                    'user_cart.product_id',
                    'user_cart.qty as quantity',
                    'product.name',
                    'product.price',
                    'product.image',
                    'product.discount',
                    DB::raw('CASE WHEN product.discount > 0
                        THEN product.price - (product.price * product.discount / 100)
                        ELSE product.price END as final_price')
                )
                ->get();

select * from `user_cart` where `user_id` = 1 and `product_id` = 6 limit 1
update `user_cart` set `qty` = 6, `updated_at` = '2025-10-14 01:38:23' where `id` = 31
insert into `user_cart` (`user_id`, `product_id`, `qty`, `created_at`, `updated_at`) values (1, 6, 1, '2025-10-14 00:53:29', '2025-10-14 00:53:29')
select sum(`qty`) as aggregate from `user_cart` where `user_id` = 1
---
    public function addToCart(Request $request)
    {
        try {
            $validator = Validator::make($request->all(), [
                'product_id' => 'required|integer|exists:product,id',
                'quantity' => 'required|integer|min:1|max:99'
            ]);

            if ($validator->fails()) {
                return response()->json([
                    'success' => false,
                    'message' => 'Invalid product or quantity'
                ], 400);
            }

            $productId = $request->product_id;
            $quantity = $request->quantity;

            // Check if item already exists in cart
            $existingCartItem = DB::table('user_cart')
                ->where('user_id', $this->userId)
                ->where('product_id', $productId)
                ->first();

            if ($existingCartItem) {
                // Update existing item
                DB::table('user_cart')
                    ->where('id', $existingCartItem->id)
                    ->update([
                        'qty' => $existingCartItem->qty + $quantity,
                        'updated_at' => now()
                    ]);
            } else {
                // Create new cart item
                DB::table('user_cart')->insert([
                    'user_id' => $this->userId,
                    'product_id' => $productId,
                    'qty' => $quantity,
                    'created_at' => now(),
                    'updated_at' => now()
                ]);
            }

            // Get updated cart count
            $cart_count = DB::table('user_cart')
                ->where('user_id', $this->userId)
                ->sum('qty');

update `user_cart` set `qty` = 5, `updated_at` = '2025-10-14 01:00:11' where `id` = 30 and `user_id` = 1
---
    public function updateQuantity(Request $request)
{
    try {
        $validator = Validator::make($request->all(), [
            'cart_id' => 'required|integer',
            'quantity' => 'required|integer|min:1|max:99'
        ]);

        if ($validator->fails()) {
            return response()->json([
                'success' => false,
                'message' => 'Invalid quantity'
            ], 400);
        }

        $updated = DB::table('user_cart')
            ->where('id', $request->cart_id)
            ->where('user_id', $this->userId)
            ->update([
                'qty' => $request->quantity,
                'updated_at' => now()
            ]);

select sum(`qty`) as aggregate from `user_cart` where `user_id` = 1
---
        }

        // Get updated cart count
        $cart_count = DB::table('user_cart')
            ->where('user_id', $this->userId)
            ->sum('qty');

delete from `user_cart` where `id` = '32' and `user_id` = 1
---
    public function removeItem($cartId)
    {
        try {
            $deleted = DB::table('user_cart')
                ->where('id', $cartId)
                ->where('user_id', $this->userId)
                ->delete();