app/Http/Controllers/CheckoutController.php

    public function index(Request $request)
    {
        $selectedCartIds = $request->input('selected_products', []);

        // If no items selected, redirect back to cart
        if (empty($selectedCartIds)) {
            return redirect()->route('cart')->with('error', 'Please select at least one item to checkout.');
        }

        // Validate that selected cart IDs exist and belong to user
        $validCartIds = DB::table('user_cart')
            ->where('user_id', $this->userId)
            ->whereIn('id', $selectedCartIds)
            ->pluck('id')
            ->toArray();

        if (empty($validCartIds)) {
            return redirect()->route('cart')->with('error', 'Selected items are no longer available.');
        }

        // Get selected cart items using valid IDs
        $selectedItems = DB::table('user_cart')
            ->join('product', 'user_cart.product_id', '=', 'product.id')
            ->select(
                'user_cart.id as cart_id',
                'product.id as product_id',
                'product.name',
                'product.price',
                'product.image',
                'user_cart.qty'
            )
            ->where('user_cart.user_id', $this->userId)
            ->whereIn('user_cart.id', $validCartIds)
            ->get();
---
select `id` from `user_cart` where `user_id` = 1 and `id` in ('30')
select `user_cart`.`id` as `cart_id`, `product`.`id` as `product_id`, `product`.`name`, `product`.`price`, `product`.`image`, `user_cart`.`qty` from `user_cart` inner join `product` on `user_cart`.`product_id` = `product`.`id` where `user_cart`.`user_id` = 1 and `user_cart`.`id` in (30)