app/Http/Controllers/HomeController.php

select * from `product` where `id` = '6' limit 1
---
    public function productDetail($id)
    {
        $product = DB::table('product')->where('id', $id)->first();