app/Http/Controllers/HomeController.php

select * from `product` where `discount` between 20 and 50
select * from `product` where `discount` between 51 and 80
select sum(`qty`) as aggregate from `user_cart` where `user_id` = 1
---
    public function index()
    {
        $discount20_50 = DB::table('product')
            ->whereBetween('discount', [20, 50])
            ->get();
        $discount51_80 = DB::table('product')
            ->whereBetween('discount', [51, 80])
            ->get();
        $cart_count = DB::table('user_cart')
            ->where('user_id', $this->userId)
            ->sum('qty');

select * from `product` where `discount` between 51 and 80
---
    public function shop(Request $request)
    {
        $query = DB::table('product');

        // Optional discount filter from URL, e.g., ?discount=20-50
        if ($request->has('discount')) {
            $discountRange = explode('-', $request->discount);
            if (count($discountRange) == 2) {
                $query->whereBetween('discount', [(int)$discountRange[0], (int)$discountRange[1]]);
            }
        }

        $products = $query->get();